package youtube;

public class Enum {

	public static void main(String[] args) {
		/*
		   열거형(enum)
		    -관련된 상수들을 같이 묶어 놓은 것. java는 타입에 안전한 열거형을 제공.
		   
		   열거형의 정의와 사용
		    -열거형을 정의히는 방법
		     enum 열거형 이름 {상수명1, 상수명2, ...}
		    -열거형 타입의 변수를 선언하고 사용하는 방법
		    -열거형 상수의 비교에 ==와 compareTo() 사용 가능
		   
		   열거형의 조상 - java.lang.Enum
		    -모든 열거형은 Enum의 자손이며, 아래의 메서드를 상속받는다.
		    -values(), valuesOf()는 컴파일러가 자동으로 추가
		    
		   열거형에 멤버 추가하기
		    -불연속적인 열거형 상수의 경우, 원하는 값을 괄호()안에 적는다.
		    -괄호()를 사용하려면, 인스턴스 변수와 생성자를  새로 추가해야 줘야 한다.
		    -열거형의 생성자는 묵시적으로 private이므로, 외부에서 객체생성 불가.
		*/
		
	}
	
}
